tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
    const uint32_t checkpointEpoch = g_app->lastKnownAliveEpoch();
    const char* resetReason = Esp32BaseSystem::resetReason();
    if (now.synced && checkpointEpoch != 0 && now.bootStartEpochSec >= checkpointEpoch &&
        (std::strcmp(resetReason, "poweron") == 0 ||
         std::strcmp(resetReason, "brownout") == 0)) {
        char checkpointText[24]{};
        char bootText[24]{};
        char message[96]{};
        if (Esp32BaseTime::formatEpoch(checkpointEpoch, checkpointText,
                                       sizeof(checkpointText), "%Y-%m-%d %H:%M") &&
            Esp32BaseTime::formatEpoch(now.bootStartEpochSec, bootText,
                                       sizeof(bootText), "%Y-%m-%d %H:%M")) {
            std::snprintf(message, sizeof(message), "%s 至 %s；仅为可能范围，不是精确停电时间",
                          checkpointText, bootText);
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "可能断电范围", message);
        }
    }
    if (config && hasEnabledZone) {
        Esp32BaseWeb::sendChunk("<dialog id='manual-watering' class='panel eb-modal manual-modal' data-eb-light-dismiss='1'><h2>手动浇水</h2><p class='muted'>可以从计划填入时长，也可以直接设置；最终只按这里提交的时长执行，不会修改计划。</p><form id='manual-form' method='post' action='/irrigation' onsubmit='return submitManualWatering(this)'><input type='hidden' name='action' value='start_zones'>");
        bool hasPlan = false;
        for (const WateringPlan& plan : config->plans) if (plan.configured) hasPlan = true;
        if (hasPlan) {
            Esp32BaseWeb::sendChunk("<div class='manual-template'><label>计划模板<select id='manual-template'><option value=''>选择一个计划</option>");
            for (const WateringPlan& plan : config->plans) {
                if (!plan.configured) continue;
                Esp32BaseWeb::sendChunk("<option value='"); sendUnsigned(plan.id);
                Esp32BaseWeb::sendChunk("' data-durations='");
                for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                    if (index != 0) Esp32BaseWeb::sendChunk(",");
                    sendUnsigned(plan.zoneDurationMinutes[index]);
                }
                uint16_t activeZoneCount = 0;
                uint32_t totalMinutes = 0;
                for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                    if (!config->zones[index].enabled || plan.zoneDurationMinutes[index] == 0) continue;
                    ++activeZoneCount;
                    totalMinutes += plan.zoneDurationMinutes[index];
                }
                Esp32BaseWeb::sendChunk("'>"); Esp32BaseWeb::writeHtmlEscaped(plan.name.data());
                Esp32BaseWeb::sendChunk(" · "); sendUnsigned(activeZoneCount);
                Esp32BaseWeb::sendChunk(" 路 · 共 "); sendUnsigned(totalMinutes);
                Esp32BaseWeb::sendChunk(" 分钟");
                Esp32BaseWeb::sendChunk("</option>");
            }
            Esp32BaseWeb::sendChunk("</select></label><button id='manual-fill' type='button' class='secondary'>填入时长</button><div id='manual-template-preview' class='manual-template-preview' aria-live='polite'></div></div>");
        }
        Esp32BaseWeb::sendChunk("<div class='manual-grid'>");
        for (uint8_t index = 0; index < config->zones.size(); ++index) {
            if (!config->zones[index].enabled) continue;
            Esp32BaseWeb::sendChunk("<div class='manual-zone'><label>");
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
            Esp32BaseWeb::sendChunk("</label><input class='manual-duration' data-zone-index='"); sendUnsigned(index);
            Esp32BaseWeb::sendChunk("' type='number' min='0' max='120' name='zone"); sendUnsigned(index + 1U);
            Esp32BaseWeb::sendChunk("' value='0' inputmode='numeric'><span>分钟</span></div>");
        }
        Esp32BaseWeb::sendChunk("</div><div class='manual-summary'><b id='manual-summary'>尚未选择水路</b><span id='manual-template-note'>每条水路范围 0～120 分钟，0 表示本次不执行。</span></div><div class='actions'><button id='manual-clear' type='button' class='secondary'>全部清零</button><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>取消</button><input id='manual-submit' type='submit' value='确认并开始浇水' disabled></div></form></dialog>");
    } else if (config) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "还没有启用水路", "请先到水路页面启用实际安装的水路。");
        Esp32BaseWeb::sendChunk("<div class='actions'><a class='btnlink info' href='/irrigation/zones'>前往水路设置</a></div>");
    }
    Esp32BaseWeb::sendChunk(R"HTML(<script>(function(){
var clock=document.getElementById('home-clock'),clockTime=document.getElementById('home-clock-time'),clockDate=document.getElementById('home-clock-date');if(clock&&clock.dataset.epoch){var clockBase=Number(clock.dataset.epoch),clockStarted=performance.now();function clockPad(v){return String(v).padStart(2,'0')}function updateClock(){var epoch=clockBase+Math.floor((performance.now()-clockStarted)/1000),d=new Date((epoch+28800)*1000);if(clockTime)clockTime.textContent=clockPad(d.getUTCHours())+':'+clockPad(d.getUTCMinutes())+':'+clockPad(d.getUTCSeconds());if(clockDate)clockDate.textContent=d.getUTCFullYear()+'年'+(d.getUTCMonth()+1)+'月'+d.getUTCDate()+'日'}updateClock();setInterval(updateClock,1000)}
var inputs=Array.prototype.slice.call(document.querySelectorAll('.manual-duration')),submit=document.getElementById('manual-submit'),summary=document.getElementById('manual-summary'),note=document.getElementById('manual-template-note'),preview=document.getElementById('manual-template-preview'),count=0,total=0;
function update(){count=0;total=0;inputs.forEach(function(input){var value=Math.max(0,Math.min(120,Number(input.value)||0));if(value>0){count++;total+=value}});if(summary)summary.textContent=count?('已选择 '+count+' 条水路 · 合计 '+total+' 分钟'):'尚未选择水路';if(submit)submit.disabled=count===0}
inputs.forEach(function(input){input.addEventListener('input',update)});
var select=document.getElementById('manual-template');function selectedOption(){return select&&select.options[select.selectedIndex]}function renderTemplatePreview(){if(!preview)return;preview.textContent='';var option=selectedOption();if(!option||!option.value){preview.classList.remove('visible');return}var values=(option.dataset.durations||'').split(',');inputs.forEach(function(input){var item=document.createElement('span'),label=input.closest('.manual-zone').querySelector('label');item.textContent=(label?label.textContent:'水路')+' '+(values[Number(input.dataset.zoneIndex)]||0)+' 分钟';preview.appendChild(item)});preview.classList.add('visible')}if(select)select.addEventListener('change',renderTemplatePreview);
var fill=document.getElementById('manual-fill');if(fill)fill.addEventListener('click',function(){var option=selectedOption();if(!option||!option.value){alert('请先选择一个计划。');return}var values=(option.dataset.durations||'').split(',');inputs.forEach(function(input){input.value=values[Number(input.dataset.zoneIndex)]||0});if(note)note.textContent='已填入所选计划时长，可继续修改；本次修改不会保存到计划。';update()});
var clear=document.getElementById('manual-clear');if(clear)clear.addEventListener('click',function(){inputs.forEach(function(input){input.value=0});if(note)note.textContent='已全部清零。';update()});
window.submitManualWatering=function(form){update();if(!count){alert('请至少为一条水路设置大于 0 的时长。');return false}return confirm('确认手动浇水 '+count+' 条水路，合计 '+total+' 分钟？')&&once(form)};update();
function poll(){fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(response){return response.json()}).then(function(status){if(status.active)location.reload();else setTimeout(poll,2000)}).catch(function(){setTimeout(poll,3000)})}setTimeout(poll,2000);
})();</script>)HTML");
    endPage();
}

