tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
    Esp32BaseWeb::beginPanel("校准样本");
    Esp32BaseWeb::sendChunk("<div class='cal-sample-toolbar'><div class='cal-counts'><span class='cal-count'><b>"); sendUnsigned(calibration.sampleCount()); Esp32BaseWeb::sendChunk("/10</b> 全部样本</span><span class='cal-count ok'><b>"); sendUnsigned(calibration.validSampleCount()); Esp32BaseWeb::sendChunk("</b> 有效</span><span class='cal-count bad'><b>"); sendUnsigned(calibration.sampleCount() - calibration.validSampleCount()); Esp32BaseWeb::sendChunk("</b> 无效</span></div>");
    if (calibration.sampleCount() != 0 && !managementLocked) Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认清空全部校准样本？设备当前使用的流量系数不会改变。')&&once(this)\"><input type='hidden' name='action' value='clear'><input class='danger' type='submit' value='全部清空'></form>");
    Esp32BaseWeb::sendChunk("</div>");
    if (calibration.sampleCount() == 0) {
        Esp32BaseWeb::sendChunk("<div class='cal-empty'><p class='cal-empty-title'>尚无校准样本</p><p class='cal-empty-text'>完成第一次采样后，有效和无效样本都会显示在这里。</p></div>");
    } else {
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part cal-samples'><thead><tr><th>样本</th><th>水路</th><th>实测总水量</th><th>启动阶段</th><th>稳态阶段</th><th>停止阶段</th><th>拟合与水量</th><th>状态</th><th>操作</th></tr></thead><tbody>");
        for (uint8_t index = 0; index < calibration.sampleCount(); ++index) {
            const FlowCalibrationService::Sample* sample = calibration.sample(index);
            const char* sampleZoneName = sample->zoneId >= 1 && sample->zoneId <= config->zones.size()
                                             ? config->zones[sample->zoneId - 1U].name.data()
                                             : "未知水路";
            Esp32BaseWeb::sendChunk("<tr><td>"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("</td><td><span class='cal-cell-main'>"); Esp32BaseWeb::writeHtmlEscaped(sampleZoneName); Esp32BaseWeb::sendChunk("</span></td><td>");
            if (sample->valid) { sendUnsigned(sample->measuredWaterMl); Esp32BaseWeb::sendChunk(" mL"); } else { Esp32BaseWeb::sendChunk("—"); }
            Esp32BaseWeb::sendChunk("</td><td>");
            if (sample->steadyDetected) { Esp32BaseWeb::sendChunk("<span class='cal-cell-main'>"); sendMilliseconds(sample->steadyStartedMs); Esp32BaseWeb::sendChunk(" / "); sendUnsigned(sample->startupPulseCount); Esp32BaseWeb::sendChunk(" 脉冲</span><span class='cal-cell-sub'>首次出水 "); sendMilliseconds(sample->flowEstablishedMs); Esp32BaseWeb::sendChunk("</span>"); } else { Esp32BaseWeb::sendChunk("<span class='cal-cell-main'>未识别稳态</span><span class='cal-cell-sub'>完整脉冲 "); sendUnsigned(sample->pulseCount); Esp32BaseWeb::sendChunk("</span>"); }
            Esp32BaseWeb::sendChunk("</td><td>");
            if (sample->steadyDetected) { char rate[24]{}; formatSignedHundredths(sample->pulseRateX100, rate, sizeof(rate)); Esp32BaseWeb::sendChunk("<span class='cal-cell-main'>"); sendMilliseconds(sample->steadyDurationMs); Esp32BaseWeb::sendChunk(" / "); sendUnsigned(sample->steadyPulseCount); Esp32BaseWeb::sendChunk(" 脉冲</span><span class='cal-cell-sub'>"); Esp32BaseWeb::writeHtmlEscaped(rate); Esp32BaseWeb::sendChunk(" P/s · "); sendUnsigned(sample->stabilityWindowSec); Esp32BaseWeb::sendChunk("秒×"); sendUnsigned(sample->requiredStableWindows); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(sample->allowedVariationPercent); Esp32BaseWeb::sendChunk("%"); if (sample->steadyLaterUnstable) Esp32BaseWeb::sendChunk(" · 后续有波动"); Esp32BaseWeb::sendChunk("</span>"); } else Esp32BaseWeb::sendChunk("—");
            Esp32BaseWeb::sendChunk("</td><td><span class='cal-cell-main'>"); sendMilliseconds(sample->stopDurationMs); Esp32BaseWeb::sendChunk(" / "); sendUnsigned(sample->stopPulseCount); Esp32BaseWeb::sendChunk(" 脉冲</span><span class='cal-cell-sub'>完整运行 "); sendDuration(sample->elapsedSec); Esp32BaseWeb::sendChunk(" · "); Esp32BaseWeb::writeHtmlEscaped(sample->stopReason == WateringStopReason::Completed ? "达到 10 分钟上限" : stopReasonName(sample->stopReason)); Esp32BaseWeb::sendChunk("</span></td><td class='cal-residual'>");
            if (!sample->valid) {
                Esp32BaseWeb::sendChunk("<span class='cal-cell-sub'>不参与计算</span>");
            } else if (!calibration.resultReady()) {
                Esp32BaseWeb::sendChunk("<span class='cal-cell-sub'>等待有效结果</span>");
            } else {
                char predicted[32]{}, residualPulse[32]{}, residualPercent[32]{};
                formatSignedHundredths(sample->predictedPulseX100,
                                       predicted,
                                       sizeof(predicted));
                formatSignedHundredths(sample->residualPulseX100,
                                       residualPulse,
                                       sizeof(residualPulse),
                                       true);
                formatSignedHundredths(sample->residualPercentX100,
                                       residualPercent,
                                       sizeof(residualPercent),
                                       true);
                char steadyWater[32]{}, nonSteadyWater[32]{};
                formatSignedHundredths(sample->estimatedSteadyWaterMlX100,
                                       steadyWater,
                                       sizeof(steadyWater));
                formatSignedHundredths(sample->estimatedNonSteadyWaterMlX100,
                                       nonSteadyWater,
                                       sizeof(nonSteadyWater),
                                       true);
                Esp32BaseWeb::sendChunk("<span class='cal-cell-main'>"); Esp32BaseWeb::writeHtmlEscaped(residualPulse); Esp32BaseWeb::sendChunk(" 脉冲 / "); Esp32BaseWeb::writeHtmlEscaped(residualPercent); Esp32BaseWeb::sendChunk("%</span><span class='cal-cell-sub'>稳态水量 "); Esp32BaseWeb::writeHtmlEscaped(steadyWater); Esp32BaseWeb::sendChunk(" mL · 非稳态 "); Esp32BaseWeb::writeHtmlEscaped(nonSteadyWater); Esp32BaseWeb::sendChunk(" mL</span><span class='cal-cell-sub'>模型预测稳态脉冲 "); Esp32BaseWeb::writeHtmlEscaped(predicted); Esp32BaseWeb::sendChunk("</span>");
            }
            Esp32BaseWeb::sendChunk("</td><td><span class='cal-status "); Esp32BaseWeb::sendChunk(sample->valid ? "ok'>有效" : "bad'>无效"); Esp32BaseWeb::sendChunk("</span></td><td><div class='cal-sample-actions'>");
            if (managementLocked) {
                Esp32BaseWeb::sendChunk("—");
            } else {
                if (sample->valid) { Esp32BaseWeb::sendChunk("<button class='secondary' type='button' onclick=\"document.getElementById('cal-edit-"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("').showModal()\">修改</button>"); }
                Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认删除这个样本？删除后无法恢复。')&&once(this)\"><input type='hidden' name='action' value='delete'><input type='hidden' name='sample' value='"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("'><input class='danger' type='submit' value='删除'></form>");
            }
            Esp32BaseWeb::sendChunk("</div></td></tr>");
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div>");
    }
    Esp32BaseWeb::endPanel();

